# Mack Aprendizado Não Supervisionado - Revisão Pandas¶

Criando um Dataframe a partir de um arquivo csv e apresentando as 5 primeiras linhas

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('c:\\dados\\employees.csv')

In [11]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal

1)Obtenha informações gerais do dataframe (quantidade, nulos, tipos etc.)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

2)Retire as amostras com missings

In [9]:
df=df.dropna()

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 764 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         764 non-null    object
 1   Gender             764 non-null    object
 2   Start Date         764 non-null    object
 3   Last Login Time    764 non-null    object
 4   Salary             764 non-null    int64
 5   Bonus %            764 non-null    float64
 6   Senior Management  764 non-null    object
 7   Team               764 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 53.7+ KB

3)Obtenha a média da série "Salary"

In [16]:
media=df['Salary'].mean()

4)Quantos homens e quantas mulheres?

In [14]:
df['Gender'].value_counts()

Female    393
Male      371
Name: Gender, dtype: int64

5)Crie uma nova coluna (série) "Bonus"..Inicialmente todos terão valor 500

In [15]:
df['Bonus']=500
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Bonus
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing,500
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,500
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance,500
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services,500
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal,500

6)Quantas mulheres ganham acima da média da empresa?

In [18]:
filter=(df['Gender']=='Female')&(df['Salary']>media)
len(df[filter])

194

In [19]:
df[filter]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Bonus
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,500
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering,500
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development,500
11,Julie,Female,10/26/1997,3:19 PM,102508,12.637,True,Legal,500
18,Diana,Female,10/23/1981,10:27 AM,132940,19.082,False,Client Services,500
...,...,...,...,...,...,...,...,...,...
977,Sarah,Female,12/4/1995,9:16 AM,124566,5.949,False,Product,500
982,Rose,Female,4/6/1982,10:43 AM,91411,8.639,True,Human Resources,500
987,Gloria,Female,12/8/2014,5:08 AM,136709,10.331,True,Finance,500
990,Robin,Female,7/24/1987,1:35 PM,100765,10.982,True,Client Services,500
991,Rose,Female,8/25/2002,5:12 AM,134505,11.051,True,Marketing,500

7)Apresente os dados de todas as Marias da empresa

In [20]:
df[df['First Name']=='Maria']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team,Bonus
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance,500
198,Maria,Female,12/27/1990,9:57 PM,36067,9.640,True,Product,500
936,Maria,Female,3/14/2003,5:23 PM,96250,10.056,False,Business Development,500
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering,500